Revit 2027 API
AnalyticalToPhysicalAssociationManager.IsAnalyticalElement Method
 Returns true if the element is an analytical element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsAnalyticalElement(
	Document doc,
	ElementId id
)
Public Shared Function IsAnalyticalElement (
	doc As Document,
	id As ElementId
) As Boolean
public:
static bool IsAnalyticalElement(
	Document^ doc,
	ElementId^ id
)
static member IsAnalyticalElement :
        doc : Document *
        id : ElementId -> bool
Parameters
doc Document
 Revit document.
id ElementId
 The element to be checked.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace